[
{
"id": "e8745221-0880-4833-b564-5a9f7848b2b9",
"type": "Full Time",
"url": "https://jobs.github.com/positions/e8745221-0880-4833-b564-5a9f7848b2b9",
"created_at": "Tue Jan 19 20:31:59 UTC 2021",
"company": "ScriptDrop",
"company_url": "http://ScriptDrop.co",
"location": "Remote ",
"title": "Software Developer ",
"description": "<p>ScriptDrop is looking for software engineers to help us scale our prescription delivery product. We are already actively delivering in markets across the U.S. and engineers will help build out additional integrations, features and new products.</p>\n<p><strong>Responsibilities</strong></p>\n<p>-Ability to own your technical stories and assignments —from writing code, clarifying requirements, meeting project timelines and delivering high-quality, workable features.</p>\n<p>-Actively participate in design and architecture for assigned projects including design reviews and code reviews.</p>\n<p>-Foster proactive and cooperative relationships within the project team.</p>\n<p>-Exercise independent judgment in selecting methods and techniques for obtaining solutions.</p>\n<p>-Code and test Elixir applications in accordance to design specifications and standards.</p>\n<p>-Analyze applications and make necessary changes to optimize performance.</p>\n<p>-Follow up with bugs in an efficient manner, including working hand in hand with test and support.</p>\n<p>-Work with a variety of technical and non-technical people.</p>\n<p>-Embrace changing requirements.</p>\n<p>​<strong>Qualifications</strong></p>\n<p>-2-5 years of programming experience.</p>\n<p>-Hands-on experience with various SQL databases (Postgres, MySQL, etc.).</p>\n<p>-Hands-on programming experience with web UI development (HTML, CSS, JavaScript, React).</p>\n<p>-Unit testing and logging.</p>\n<p>-Strong communication skills.</p>\n<p>-Hands-on experience with Elixir, Erlang or Ruby is a plus.</p>\n",
"how_to_apply": "<p>Visit scriptdrop.co</p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlNWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e12ea0dd6432ee35d482ca1fe8f47720b288fd45/Heart%20Icon%20-%20Navy%20Solid%20(RGB).png"
},
{
"id": "9c321633-2c98-44d7-a09e-8f3a5f8edd16",
"type": "Full Time",
"url": "https://jobs.github.com/positions/9c321633-2c98-44d7-a09e-8f3a5f8edd16",
"created_at": "Mon Jan 18 19:42:36 UTC 2021",
"company": "EME Hive",
"company_url": "http://emehive.co",
"location": "New York City",
"title": "Software Engineer w/ Ruby Experience",
"description": "<p>WHO WE ARE</p>\n<p>EME Hive is a community-based, social live streaming app for finding like-minded friends and partners. Through the power of live streaming technology, users are able to form real-time connections with members of their own communities. By offering a subscription dating service as well as a live streaming platform, EME makes it easy for users to flirt, chat, and date in real-time -- all within the same app!</p>\n<p>We are a team of innovative, and friendly individuals who are redefining the rules of connecting with others. We believe that our dedication to livestreaming and online dating technologies will bring highly efficient and safer connections to many minority communities all over the world. We are currently looking for a Software Engineer with Ruby on Rails experience to join our growing team and share our enthusiasm for taking on today’s toughest challenges in livestreaming.</p>\n<p>WHO YOU ARE</p>\n<ul>\n<li>Experienced software engineer - with high level technical skill</li>\n<li>Collaborative, and excited to be a key player in the team</li>\n<li>Passionate about open source technology, continuous learning, pair programming, peer code reviews, and technical talks</li>\n</ul>\n<p>WHAT YOU'LL DO</p>\n<p>EME Hive is looking for a Software Engineer with Ruby on Rails experience to join our team and help drive the future of our business. You will be working with highly motivated and extremely talented engineers with quality, performance and scale in mind. Our core belief is that the customers are our number one priority so we work hard to deliver value back to them with everything we do. We believe strongly in team ownership of systems, which includes defining the vision of the services to prioritization of projects.</p>\n<p>Key Responsibilities</p>\n<ul>\n<li>Building EME Hive's best-in-class web-based UI that emphasizes ease-of-use, simplicity, clarity, and performance</li>\n<li>Contributing to all aspects of the services under the team’s ownership, which includes developing new and innovative features</li>\n<li>Optimizing for scale</li>\n<li>Identifying opportunities for process and tool improvements</li>\n<li>Collaborating on the vision of the services under the team's ownership\nOther responsibilities;</li>\n<li>Engineers are expected to support systems they develop in production</li>\n</ul>\n<p>WHAT YOU MUST HAVE</p>\n<ul>\n<li>\n<p>BS or MS degree in Computer Science</p>\n</li>\n<li>\n<p>2+ years of relevant software development experience</p>\n</li>\n<li>\n<p>Deep technical background coding in JavaScript, HTML, and CSS</p>\n</li>\n<li>\n<p>Experience shipping iOS applications or Web applications with Ruby on Rails</p>\n</li>\n<li>\n<p>Experience with software engineering practices (e.g., unit testing, code reviews, design documentation)</p>\n</li>\n<li>\n<p>Strong knowledge of how the Web works and how to make it efficient (HTTP, caching, page rendering, etc)</p>\n</li>\n<li>\n<p>Solid software development fundamentals (Data Structures, algorithms, problem solving, OO Design, and system architecture)</p>\n</li>\n<li>\n<p>Experience working closely across a variety of teams including product management, designers, and backend engineers</p>\n</li>\n<li>\n<p>Ability to clearly communicate to technical and non-technical audiences</p>\n</li>\n<li>\n<p>A dedicated and enthusiastic approach to solving problems</p>\n</li>\n<li>\n<p>Passionate about what you do and care deeply about the things you build\nWHAT WE'D LIKE YOU TO HAVE, BUT NOT A DEAL BREAKER</p>\n</li>\n<li>\n<p>Data-informed product development experience (e.g., analytics, A/B testing)</p>\n</li>\n<li>\n<p>Experience with some technologies: AWS, Docker, Android or Machine Learning</p>\n</li>\n</ul>\n",
"how_to_apply": "<p>Email your resume and cover letter to <a href=\"mailto:recruiting@emehive.co\">recruiting@emehive.co</a>.</p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc21WIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--901f710581337a122dc565db7898bae68fd05007/purple.png"
},
{
"id": "cb287f27-8e08-4677-88e5-4d025a1fee08",
"type": "Full Time",
"url": "https://jobs.github.com/positions/cb287f27-8e08-4677-88e5-4d025a1fee08",
"created_at": "Mon Jan 11 21:27:35 UTC 2021",
"company": "PayPal",
"company_url": "http:",
"location": "San Jose, CA",
"title": "Distinguished Eng.-Platform Unification",
"description": "<p>Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 305 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.</p>\n<p>The Commerce Solutions and Services Engineering (CSSE) team is responsible for building solutions and platforms used by all PayPal’s merchants, focusing on the largest customers – the Enterprise, Channel Partners and Marketplaces customer segments. We build applications, services and platforms that allow PayPal customers to accept payments globally across all channels, including the Commerce Platform for Enterprises (<a href=\"https://www.paypal.com/us/business/enterprise\">https://www.paypal.com/us/business/enterprise</a>), Commerce Platform for Platforms and Marketplaces (<a href=\"https://www.paypal.com/us/business/platforms-and-marketplaces\">https://www.paypal.com/us/business/platforms-and-marketplaces</a>), Braintree platform (<a href=\"https://www.braintreepayments.com\">https://www.braintreepayments.com</a>), Hyperwallet platform (<a href=\"https://www.hyperwallet.com\">https://www.hyperwallet.com</a>), among many other responsibilities</p>\n<p>As a Distinguished Engineer in our team, you will be leading development to define how large-scale merchants worldwide integrate with the current and next-gen PayPal Commerce Platforms. You will play a critical role integrating complex systems and multiple properties into one seamless, unified platform that leverages multiple engines to provide a powerful payments and payouts experience, including API strategy (GraphQL and REST, webhooks, streaming, SDKs), sandbox and playground environments, simulators, and all other aspects of integration and developer experience. These platforms combined are responsible for processing more than half of PayPal’s transactions worldwide, so this is a high-stakes role – there are very few mission critical APIs like this in the world, with this kind of scale and complexity, and that power so much commerce and so many businesses worldwide. You will play a key and critical role defining how the platform developer experience is shown to the world.</p>\n<p>The ideal candidate will prefer to have no direct reports, being passionate to focus on very hard and deep technical problems, and collaborating with many teams to move big rocks forward. That said, as one of the senior-most individual contributors in the engineering ladder, the candidate will be expected to lead hundreds of others through influence, providing guidance and mentoring as needed, making the whole team better through experience, knowledge and technical talent, making the entire organization more capable of successfully completing larger projects with higher technical complexity.</p>\n<p>Finally, the ideal candidate has a proven record of leading efforts to solve large, complex problems. They balance competing technical and product requirements, level up the engineers around them, identify and communicate effectively with all stakeholders, and consider both immediate tactical needs and long-term strategic planning.</p>\n<p>Responsibilities:</p>\n<p>· Work with Product, Platform and Engineering leaders across the team to identify the most valuable areas of technical contribution, advancing key valuable initiatives, reducing risk on critical projects and advancing our technology stack.</p>\n<p>· Drive both technology and product innovation through rapid prototyping and iterative development.</p>\n<p>· Provide technical guidance and leadership in design, development, scaling and operation of software applications.</p>\n<p>· Be a technical subject matter expert and represent the full internal and external capabilities of our platforms to enable solutions to complex, large-scale customers.</p>\n<p>· Mentor, coach, advise and level up engineering talent across the organization.</p>\n<p>Skillset and requirements:</p>\n<p>· Bachelors degree in Computer Engineering/Computer Science or related field.</p>\n<p>· Track record leading, developing, and delivering significant software projects.</p>\n<p>· Expertise in designing and troubleshooting large scale distributed systems.</p>\n<p>· Proficiency in managing cloud based large-scale infrastructure. Experience with building solutions on the Cloud (ideally GCP and AWS). Experience designing and building systems with Docker containers and Kubernetes.</p>\n<p>· Experience in Domain Driven Design and modeling complex business domains.</p>\n<p>· Demonstrable experience building complex customer facing platforms, inclusive of complex APIs and other aspects of developer experiences (sandbox, playgrounds, simulators, etc.).</p>\n<p>· Demonstrable and in-depth experience with Java stack. Ruby on Rails very desirable.</p>\n<p>· Some experience with JavaScript and Node.js is highly desired.</p>\n<p>· Experience with Unix/Linux operating systems internals and administration.</p>\n<p>· Established experience with monitoring/logging tools and best practices.</p>\n<p>· Experience in software release lifecycle with modern distributed version control (e.g. git).</p>\n<p>· Experience working in an Agile environment, including Extreme Programming practices like Iterative Development, Continuous Integration (and Deployment) and Test-Driven Development.</p>\n<p>· Great analytical and problem-solving skills.</p>\n<p>· Strong communicator, both written and spoken.</p>\n<p>Behaviors:</p>\n<p>· Approach problems with humility, rigor, and decisiveness.</p>\n<p>· Demonstrate a high emotional quotient and empathy for your colleagues, creating psychological safety while tackling tough problems and navigating conflicts.</p>\n<p>· Identify and solicit input from all stakeholders, balancing competing needs and distilling a coherent strategy.</p>\n<p>· Lead by meeting people where they are at and building bridges to where you need them to go.</p>\n<p>· Emphasize iterative progress, risk management, and delivering value.</p>\n<p>· Leave the campsite cleaner and people stronger.</p>\n<p>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</p>\n<p>PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at <a href=\"mailto:paypalglobaltalentacquisition@paypal.com\">paypalglobaltalentacquisition@paypal.com</a>.</p>\n",
"how_to_apply": "<p>Please email: <a href=\"mailto:mamunro@paypal.com\">mamunro@paypal.com</a></p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHFWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1bcca8c1ef0e38811264e5d86c556bd4c368cb48/paylog.png"
},
{
"id": "c05204de-9a30-4b5d-9e53-4db079155253",
"type": "Full Time",
"url": "https://jobs.github.com/positions/c05204de-9a30-4b5d-9e53-4db079155253",
"created_at": "Mon Jan 11 03:48:08 UTC 2021",
"company": "ExpressVPN",
"company_url": "http://www.expressvpn.com",
"location": "London / Poznan / Remote",
"title": "Server-side Software Developer",
"description": "<p><strong>Location: London or Poznan or Remote (within Europe or Asia)</strong></p>\n<p><strong>We're looking for creative server-side software developers</strong></p>\n<p>Join our back-end teams building user-friendly online services for consumers. We use a micro-services architecture with a broad range of different technology stacks and high levels of automated test coverage. The majority of our back-end is written in Ruby.</p>\n<p><strong>Highlights</strong></p>\n<ul>\n<li>Scale and performance challenges. Handle tens of thousands of rpm, scale across geographically distributed datacenters, solve complex computational tasks quickly, and be highly available.</li>\n<li>Security. We work with world-class penetration testers.</li>\n<li>API design. We have client-side apps for Windows, Mac, Android, iOS, Linux, routers, and browser extensions for Chrome, Firefox, and Safari. Keep the API designs simple and meet the various requirements for our apps.</li>\n<li>Split-testing. We make heavy use of A/B testing to optimize our front-end for sales conversions. We have enough volume to often get significant results within one day.</li>\n</ul>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>\n<p>Your responsibilities may cover systems that each bring their own set of interesting technical and design challenges, especially around scale, security, and availability.</p>\n</li>\n<li>\n<p>Continuous Delivery. All logic is tested automatically. We deploy multiple times per day. We often use TDD.</p>\n</li>\n<li>\n<p>Microservices architecture. We can pick the right stack for each individual application. Currently those involve combinations of Ruby, Go, Node.JS, C, mySQL, Postgres, Redis, MongoDB, RabbitMQ, Docker, Chef and Ansible.</p>\n</li>\n<li>\n<p>Code-reviews. We invest in spreading knowledge around the team, and keeping our code easy to read, test, and maintain.</p>\n</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>You love to solve problems, you’re excited about building well-designed systems, eager to learn and continually improve your skills.</li>\n<li>You take great pride in the quality of your code</li>\n<li>Expert in at least one modern server-side language. You test your code primarily with automation.</li>\n<li>Eager to learn some Ruby (you’ll see a lot of it here, though it won’t necessarily be your primary language)</li>\n</ul>\n<p><strong>Optional</strong></p>\n<ul>\n<li>Nice to have: Experience building high-load scalable systems</li>\n<li>Nice to have: Devops experience (Linux, Docker, Nginx, Ansible, Kubernetes, Terraform, Cloud-based Databases, Queues)</li>\n<li>In general, we’re looking for someone with raw smarts and potential who can easily learn the specific skills needed for our work.</li>\n<li>We’re open to candidates with various levels of experience. From junior to very senior, come talk to us!</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>Challenging work in a fun and collaborative environment</li>\n<li>Attractive compensation and time-off benefits</li>\n<li>Spacious open-concept and centrally located offices</li>\n<li>Full-time employment with flexible working hours</li>\n<li>Fully stocked pantry with fresh fruit and snacks</li>\n<li>Team lunches and company events every quarter</li>\n<li>Multicultural teams represented by 30+ nationalities</li>\n</ul>\n<p><strong>Note: Please upload your resume as a PDF and do not include any salary or compensation information in it.</strong></p>\n",
"how_to_apply": "<p><a href=\"https://grnh.se/9dea5ab52us\">Apply Here</a></p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0NWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--25d3d1c869a42925cd041c9f6188aea859b6631c/affiliate-assets_-logo-expressvpn-red-square-stacked.png"
},
{
"id": "72dd792b-5789-4451-b403-9510d0e478d3",
"type": "Full Time",
"url": "https://jobs.github.com/positions/72dd792b-5789-4451-b403-9510d0e478d3",
"created_at": "Thu Jan 07 15:36:41 UTC 2021",
"company": "Rails Machine",
"company_url": "https://www.railsmachine.com",
"location": "REMOTE",
"title": "Site Reliability Engineer",
"description": "<p>Rails Machine has been handling infrastructure and managed operations for Rails Applications since 2006.  We handle all of our customers Infrastructures, Daily Operational needs, and 24x7 Alert Response so that they can focus on their application.   If you’re passionate about Ruby on Rails and managing Cloud Infrastructure, you’re going to LOVE working with us.</p>\n<p>Minimum Qualifications :</p>\n<ul>\n<li>\n<p>Experience with config management or automation frameworks. (i.e. Ansible / Terraform /  CloudFormation / Capistrano)</p>\n</li>\n<li>\n<p>Proficient in at least one Programming Language</p>\n</li>\n<li>\n<p>Experience maintaining production infrastructure in a Linux Environment.</p>\n</li>\n<li>\n<p>Strong DevOps Experience and Customer Service mindset.</p>\n</li>\n<li>\n<p>Ability to participate in on-call/pager rotation.</p>\n</li>\n<li>\n<p>U.S. Residents Only.</p>\n</li>\n</ul>\n",
"how_to_apply": "<p>Interested? Tell us what you can bring to the team by emailing <a href=\"mailto:hiring@railsmachine.com\">hiring@railsmachine.com</a> !</p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcytVIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--321295c0e9e1fc8abf130bbab878469d2fb87f37/RM-Logo-1x1.png"
},
{
"id": "377e8e58-7bd1-45ca-8ccf-4d633381d4c8",
"type": "Full Time",
"url": "https://jobs.github.com/positions/377e8e58-7bd1-45ca-8ccf-4d633381d4c8",
"created_at": "Thu Jan 07 06:47:16 UTC 2021",
"company": "Ikayzo",
"company_url": "http://ikayzo.com",
"location": "United States",
"title": "Senior Enterprise Software Engineer (Kotlin)",
"description": "<p><em>Work with an award-winning team designing and implementing systems for customers from New York to Tokyo.</em> Ikayzo, a boutique software development and interactive design agency, is looking for a Senior Enterprise Software Engineer (Kotlin / Spring) capable of taking complex projects from ideation to release. In this role he/she will be responsible for designing and implementing applications for a wide range of customers ranging from fintech startups and renewable energy companies to global banks. We promote from within, and this position has the potential to develop into a tech lead role. Ikayzo offers competitive compensation and benefits including 24 days of paid time off per annum for full time employees.</p>\n<p><em>Note: We are currently only hiring in the United States and Japan. Remote developers are being considered, but they must be US or Japanese citizens or have valid work visas.</em></p>\n<p><strong>Job Description</strong></p>\n<p>The position of Senior Enterprise Software Engineer entails software architecture, implementation, development of best operational practices, testing and documentation of non-trivial systems with massive scalability requirements. Full stack experience with popular client frameworks such as  React.js is preferred. As a boutique consultancy we are looking for motivated individuals who do not require step-by-step directions and can work cohesively with our team.</p>\n<p>Successful applicants will have a proven track record with non-trivial enterprise Kotlin and Java projects, be comfortable with agile development methodologies, have a solid grounding in OO software architecture / design patterns and be comfortable with the enterprise Kotlin / Java technology stack including frameworks such as Spring from front to back. Most importantly, candidates must have a passion for programming. Our interviews are rigorous, so only serious developers with the requisite skills need apply.</p>\n<p>Send your resume and a link to your GitHub profile to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a>.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>A solid grounding in OO software architecture / design patterns</li>\n<li>Experience designing and implementing successful non-trivial enterprise Kotlin projects</li>\n<li>Experience with agile development methodologies</li>\n<li>Deep knowledge of the de facto Kotlin enterprise stack including Spring and Hibernate</li>\n<li>Firm grasp of data modeling</li>\n<li>A passion for software development</li>\n</ul>\n<p><strong>Preferred</strong></p>\n<ul>\n<li>PostgreSQL and MongoDB expertise</li>\n<li>Contributions to open source projects</li>\n<li>Financial systems experience a plus</li>\n<li>Familiarity with React.js</li>\n</ul>\n<p><strong>About Ikayzo</strong></p>\n<p>Ikayzo is a boutique software development and interactive design agency working in areas ranging from fin-tech to renewable energy. Ikayzo develops desktop, web and mobile applications for multiple platforms including Ruby on Rails, Kotlin / Java, iPhone, Android, and .NET. We are active in the open source community.</p>\n<p>Ikayzo has worked with Google, IBM, Intel, Sun, Adobe, Oracle, Apache, Red Hat and SAP on developing technology standards for everything from enterprise software to scientific applications. From New York to Tokyo, our customers range from database leader Oracle to trusted financial institutions like Bank of America. We work with customers of all sizes in a variety of industries including biotechnology, banking, renewable energy, social media / web 2.0 and software.</p>\n",
"how_to_apply": "<p>Email resume and GitHub profile to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a></p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e254e5368909e8a838138a58a81c6d352af03cdd/logo-final.png"
},
{
"id": "a01151be-f939-48e7-9ce8-2d15cf88ce65",
"type": "Full Time",
"url": "https://jobs.github.com/positions/a01151be-f939-48e7-9ce8-2d15cf88ce65",
"created_at": "Tue Jan 05 18:56:16 UTC 2021",
"company": "Parade",
"company_url": "https://yourparade.com",
"location": "Remote",
"title": "Frontend Engineer",
"description": "<p>Parade is growing! We are hiring another remote, full-time frontend developer to join our Digital team as we continue to rewrite the American underwear story.</p>\n<p>As a front-end developer, you’ll build innovative e-commerce digital products to provide our community with a seamless and fun shopping experience. You’ll do much more than just write code - you’ll be an integral part of the entire digital product development process, from ideation through delivery and iteration.</p>\n<p>You’ll work on our Digital team, made up of folks across growth, design, and engineering, to drive our business forward and bring Parade to hundreds of thousands of people across the United States over the next year. This role reports to the Head of Engineering and will work closely with both them and our current engineer.</p>\n<p>Our Stack &amp; Process:\nNew frontend projects typically start with a set of Figma designs, coupled with detailed interaction notes, which we’d hand off to you. You’ll take these and turn them into live code on a weekly cadence. We value good software and believe in nimbleness as a defining characteristic of our success.</p>\n<p>Our storefront runs on Shopify Plus, so you should be comfortable with Liquid templating and generally know your way around Shopify theme development and deployment. Strong HTML, CSS, and JS skills are a must-have. You should also be comfortable doing performance optimization on the frontend (and it’s a bonus if you’ve also previously optimized Liquid code.) It’s also important to have experience collaborating on complex, multi-developer projects.</p>\n<p>It’s also a plus if you’ve ever worked with (or are comfortable building) Ruby on Rails apps -- we have a custom backend that powers a bunch of missing Shopify features, as well as supports our Product and Community teams’ internal processes; you’d periodically be helping ship features there, too. We typically operate on a one- to three-week sprint cycle, but are not overly dogmatic and prioritize opportunities to impact the business day-to-day.</p>\n<p>Role &amp; Responsibilities:\nThis is a fully-remote, full-time position. We’d start with a paid sample project, building a hypothetical new feature for our live storefront, as well as doing some brainstorming exercises around how you think about product. We’re mostly in LA and NYC, so at minimum you should be able to be available for a chunk of time during Eastern Time working hours. Ideally you’re someone who has always worked remotely, are comfortable communicating over Slack and email, and can self-manage your time and priorities.</p>\n<p>Required Experience:</p>\n<ul>\n<li>You have 4+ years of web development experience in E-Commerce, with at least some Shopify experience</li>\n<li>Strong JavaScript development skills and understanding of new ES6 concepts</li>\n<li>Expert knowledge of CSS/SCSS and implementing web animations</li>\n<li>Experience with integrating front-end frameworks like React with Shopify</li>\n<li>Knowledge of build tools like Webpack and Babel for web performance and optimization.</li>\n<li>Strong design instincts and enjoys working collaboratively with a team of designers</li>\n<li>A commitment to creating readable, clean, and well documented code</li>\n</ul>\n<p>Very Nice to Have:</p>\n<ul>\n<li>A website or a portfolio</li>\n<li>Experience with Shopify Plus, Storefront API, GraphQL, and Ruby on Rails</li>\n<li>Experience with headless architecture</li>\n<li>Experience managing projects end to end</li>\n</ul>\n<p>Benefits + Perks</p>\n<ul>\n<li>Medical, dental, and vision insurance</li>\n<li>Competitive compensation, including equity</li>\n<li>Paid time off including Vacation PTO, Sick Leave, and Quarterly Company-wide Wellness Days</li>\n<li>WFH setup stipend</li>\n<li>Commuter benefits</li>\n<li>Employee discounts on Parade products</li>\n</ul>\n",
"how_to_apply": "<p>Apply via Lever: <a href=\"https://jobs.lever.co/ParadeInc/115b5c46-5880-427e-bd18-76618a89d2e7?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/ParadeInc/115b5c46-5880-427e-bd18-76618a89d2e7?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb21VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e1ac88258fbd6286ab8c24e4ebb39d803ae1f613/parade-logo.png"
},
{
"id": "cbc32e59-c23b-401b-983b-93483dbb72d1",
"type": "Full Time",
"url": "https://jobs.github.com/positions/cbc32e59-c23b-401b-983b-93483dbb72d1",
"created_at": "Wed Dec 23 16:09:15 UTC 2020",
"company": "Tolq.com",
"company_url": "http://tolq.com",
"location": "remote job",
"title": " Front End Engineer (Javascript)",
"description": "<p><strong>Intro</strong></p>\n<p>We are looking for an additional Front End Developer who can help us to build and improve our platform. If you like working in a fast-paced environment where you can really add value, this is the job for you!</p>\n<p>We are accepting applications for the next two months and we fill the open position as soon as we’ve found the right candidate.</p>\n<p><strong>About the Position</strong></p>\n<p><em>Front End Engineer (Javascript)</em></p>\n<p>These are the most important aspects you’ll be working on:</p>\n<ul>\n<li>Implement complex components such as rich text editors that dynamically analyses what is written in them and enriches it.</li>\n<li>Come up with sound architectures to support fast and rich web apps with hundreds of moving pieces.</li>\n<li>Refactoring outdated pieces of code into something awesome.</li>\n<li>Work in close collaboration with the development and design teams.</li>\n</ul>\n<p><strong>About Tolq</strong></p>\n<p>Tolq’s goal is to eliminate language barriers and to do that we’ve built a lot of technology that makes it easier for companies to translate their content. Our clients range from Bol.com, to MediaMarkt to Belvilla and many others</p>\n<p>We have our HQ in The Hague in The Netherlands and we are remote first (so location is not an issue).</p>\n<p>We have an open ‘startup-like’ mentality and are a software company from origin.</p>\n<p><em>What else can you expect from us?</em></p>\n<ul>\n<li>Enthusiastic and fun colleagues</li>\n<li>Startup mentality and possibilities</li>\n<li>Friday afternoon drinks and/or (theme)parties (when COVID allows)</li>\n</ul>\n<p>You can expect a mindful onboarding process with ramp-up and time to learn. You can expect a team that listens, and to be heard. You can expect to give and provide direct feedback. You can expect to be counted on. You can expect to do your best work and build a career here.</p>\n<p><strong>About You</strong></p>\n<p>We are looking for someone who is ready for this challenge with a getting things done work spirit.</p>\n<p><em>Skills</em></p>\n<ul>\n<li>You are crazy about building beautiful and intuitive interfaces</li>\n<li>You enjoy tough challenges</li>\n<li>You are driven and enthusiastic</li>\n<li>You can handle a fast-paced, ever-changing, and deadline-driven environment</li>\n<li>Your communication skills in English are proficient</li>\n</ul>\n<p><em>Experience</em></p>\n<ul>\n<li>At least 2 years using React and Redux,  good knowledge of its weakest points and how to avoid them.</li>\n<li>At least 5 years of experience developing web applications</li>\n<li>Experience with testing frameworks</li>\n<li>Experience with GraphQL</li>\n</ul>\n<p><em>Good to have</em></p>\n<ul>\n<li>Ruby on Rails experience</li>\n<li>UX design capabilities with special emphasis on usability.</li>\n<li>Experience building SPAs from the ground up choosing a solid architecture fit for the problem.</li>\n<li>Good capabilities solving hard CSS problems</li>\n</ul>\n<p><strong>How to Apply</strong></p>\n<p>You can apply via <a href=\"https://tolq.recruitee.com/o/front-end-engineer-javascript-den-haag\">https://tolq.recruitee.com/o/front-end-engineer-javascript-den-haag</a>\nPlease send an application that speaks directly to how you would like to fill this position. There are no right answers or expectations. Show us your role in Tolq’s future and our role in yours. Address some of the work we do. Introduce yourself as a colleague. Feel free to respond in either Dutch or English.</p>\n<p>Please do NOT apply for this position if you just did IronHack, Codaisseur or one of the other basic coding bootcamps - or apply as an intern.</p>\n",
"how_to_apply": "<p><a href=\"https://tolq.recruitee.com/o/front-end-engineer-javascript-den-haag\">https://tolq.recruitee.com/o/front-end-engineer-javascript-den-haag</a></p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVNUIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a038e0b2fbeff1f22fb2bca9d57416d19885d519/Tolq%20logo.png"
},
{
"id": "2413ae3e-7cc1-49ad-b901-c02f0e47ffb6",
"type": "Full Time",
"url": "https://jobs.github.com/positions/2413ae3e-7cc1-49ad-b901-c02f0e47ffb6",
"created_at": "Mon Dec 21 17:47:11 UTC 2020",
"company": "Ably",
"company_url": "http://Ably",
"location": "London, UK",
"title": "Site Reliability Engineer",
"description": "<p>Team: Engineering</p>\n<p>Location: Remote, mainly UK based individual, as travel to our London office will be required periodically.</p>\n<p>Working at Ably means helping to build the infrastructure that will power and shape the future of the internet. We enable things like HubSpot’s chat and collaboration products, live scores for millions of Australian Open tennis fans, and real time transit updates for three million Chicagoans. Engineers at some of the largest companies in the world choose Ably because, when it comes down to it, we’re the only platform that dependably delivers on the most demanding realtime requirements at global, production scale.</p>\n<p>The opportunity in front of us is immense. Our mission is to become the definitive realtime infrastructure of the internet while powering and accelerating the emerging ecosystem. We’re on track. Today we deliver billions of realtime messages to more than 50 million people across web, mobile, and IoT platforms. But we can’t rest yet. In five years we want to reach one billion people everyday</p>\n<p>To see what life’s like at Ably, check out our careers page at <a href=\"http://www.ably.io/careers\">www.ably.io/careers</a>.</p>\n<p>What we do</p>\n<p>Ably’s engineering team is deeply technical, collectively bringing a wealth of experience and broad technology skills across infrastructure, security, distributed systems, and much more. The calibre of the code we produce is what excites and motivates us each day. If you enjoy solving hard distributed system problems that are mostly platform agnostic and theoretical in nature, then you'll love working at Ably.</p>\n<p>In this role</p>\n<p>You will report to the Head of Infrastructure and will have responsibility for all aspects of Ably’s infrastructure services. Together, these provide compute capacity, networking, and all ancillary services required to operate the core services and support the complete development cycle for all Ably products and services.</p>\n<p>You will be successful if you:</p>\n<ul>\n<li>Have a deep technical understanding of how systems work top-to-bottom and are committed to</li>\n<li>continuing to advance that understanding</li>\n<li>Enjoy getting your hands dirty, getting things done, and seeing your creations from inception through to production use by consumers’ apps</li>\n<li>Understand the Site Reliability Engineering discipline (<a href=\"https://go.ably.io/what-is-sre\">https://go.ably.io/what-is-sre</a>) and are excited by the idea of infrastructure-as-code and no manual maintenance of systems.</li>\n<li>Care about technical excellence in your work and fitness for purpose in your code</li>\n<li>Want to join a team that’s on a mission to provide the best possible service for our customers</li>\n<li>You will be expected to participate in an on-call rotation after your onboarding and training phase.</li>\n</ul>\n<p>Technical skills needed</p>\n<p>Ably is a cloud-native business with infrastructure that is almost wholly cloud-based, and we expect that to remain the case, at least in the near and medium term. Therefore, you must be intimately familiar with operations at scale on public cloud infrastructure, using the full range of functionality from the public cloud providers.</p>\n<p>This is not a traditional sysadmin role, we expect software engineering skills. You will be working to support the work of our product engineering teams, so you will need a strong understanding of their pressures and needs. Ably’s infrastructure operations are based currently on internally-developed software for deployment and orchestration, instance management and health monitoring, plus administration of the multiple ancillary systems used to operate the service. Therefore, you need to be a developer first, and have an established record of software development in production systems.</p>\n<p>As with all of our developer roles, we strongly prefer candidates that have a track record of working with open source, either with their own projects or contributions to community projects.</p>\n<p>Much of our existing infrastructure management code is written in Ruby and Go. We very much would like to see Ruby experience, even if not as a main language, and Go experience is advantageous.</p>\n<p>Our infrastructure runs in the public AWS cloud and therefore we need to see in-depth experience of operating production systems in the public cloud, and a detailed understanding of the full range of cloud services we use. Our software runs in large clusters and in AWS regions around the world, so experience with the engineering challenges of large, geographically distributed systems is valuable.</p>\n<p>We expect you to be very strong technically in Linux systems administration and networking.</p>\n<p>Nice to have skills:</p>\n<ul>\n<li>Containerisation, Docker;</li>\n<li>Orchestration with Kubernetes or similar frameworks;</li>\n<li>Go, Node.js and Bash;</li>\n<li>Cassandra;</li>\n<li>Experience with CI/CD systems;</li>\n<li>Our team are active open source contributors and are encouraged to do this as part of their role at Ably. We like new team members who enjoy contributing back to the open source community, even if those contributions are small.</li>\n</ul>\n<p>What’s it like to work at Ably?</p>\n<p>Founded by two engineers who spotted a hard and largely unsolved problem, Ably is, at its heart, an engineering company. To provide the infrastructure required for a high-bandwidth, always-connected world, we hire engineers with a broad set of technical skills who are ready and capable of taking on challenging realtime engineering problems.</p>\n<p>As a company and engineering team we’re committed to a future internet that’s open, with all engineers contributing to existing open source projects.</p>\n<p>We want to work in a company of inclusive people who treat each other well. As an Ablyan, you’ll enjoy taking ownership and making an impact, with work that is both varied and challenging. And to really thrive at Ably, you’ll need to believe in and be prepared to do your work in line with our values, which are:</p>\n<ul>\n<li>Open For All. Open is a mindset. When open, we’re better collaborators, communicators and creators. Whether open source, standards, or protocols, open hearts, minds, and eyes. It’s better when it’s open.</li>\n<li>Bias For Action. We avoid analysis paralysis at all costs. We lean into doing in order to move us forward. When we have enough of what we need to act, we act.</li>\n<li>Even The Best Do Better. We want to be the best - but that doesn’t mean we rest when we are. Improvement and growth - true betterment - is an ongoing journey. One fuelled by curiosity and taking risks.</li>\n<li>Technology Needs Humanity. Our technology means little without people - whether that’s how we treat our colleagues, or how we design developer experiences. Being human matters.</li>\n<li>Dependable People Make Dependable Things. Dependability is integral to our mission and technology, but being dependable starts with our people. When we care enough to take real ownership of our products and problems - all else will follow.</li>\n</ul>\n<p>What’s in it for you?</p>\n<ul>\n<li>A good, competitive salary</li>\n<li>A great company culture</li>\n<li>Share options</li>\n<li>A remote first company. Unless you want to pop into our communal office space in Shoreditch, you'll work from home most of the time, apart from when we have planning sessions and summits.</li>\n<li>Health insurance, including Doctor@Hand</li>\n<li>Employee Assistance Programme</li>\n<li>Wellness benefit</li>\n<li>Regular company away days and social events</li>\n<li>Weekly team drinks and snacks</li>\n<li>Ongoing professional development (training, events, conferences)</li>\n<li>Charity volunteer day</li>\n<li>25 days of paid annual leave (33 days including bank holidays)</li>\n<li>Company contributions towards your pension</li>\n</ul>\n<p>If you enjoy working as part of a technology company, value open source, and love solving hard problems - then we’d love to hear from you, regardless of whether you fit the spec exactly or not. If in doubt, drop us an email at <a href=\"mailto:jobs@ably.com\">jobs@ably.com</a>, we’d be more than happy to give you some advice on your application.</p>\n",
"how_to_apply": "<p>Send your details over to: <a href=\"mailto:jobs@ably.com\">jobs@ably.com</a>. Applying with just your github profile is fine, although it would be great if it was supported by your CV or a blurb which details your knowledge/experience to date.</p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaitUIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6552765a2e41fc22764de7563db66dbcdb504301/5a5d9e561de1436558364b30b3d5717d_400x400.png"
},
{
"id": "e4c21b53-f5e5-4155-8390-f6750b8e17f5",
"type": "Full Time",
"url": "https://jobs.github.com/positions/e4c21b53-f5e5-4155-8390-f6750b8e17f5",
"created_at": "Mon Dec 21 10:47:28 UTC 2020",
"company": "lawpilots GmbH",
"company_url": "https://www.lawpilots.com/de-de/",
"location": "Berlin",
"title": "Systemadministrator / IT Operations (m/w/d)",
"description": "<p><strong>Intro</strong></p>\n<p>Join us in Berlin</p>\n<p>At lawpilots, we create digital learning that people love. E-learning is one of the growth markets of the future - even more so during the current crisis.</p>\n<p><strong>Your mission</strong></p>\n<ul>\n<li>Help maintain and extend our current learning platform</li>\n<li>Participate in the design, development and maintenance of new systems and components</li>\n<li>Automate our internal and public-facing infrastructure</li>\n<li>Document our system landscape, including decision documents and overview diagrams</li>\n<li>Contribute to requirements analysis</li>\n<li>Implement reliable logging and monitoring solutions</li>\n<li>Ensure security and data compliance throughout our services</li>\n<li>Help customers, both prospective and current, to make the best use of our platform by helping them use our interfaces efficiently</li>\n<li>Work with our customer success and sales teams to help them onboard and support  customers</li>\n</ul>\n<p><strong>Your profile</strong></p>\n<ul>\n<li>Bachelor’s Degree in Computer Science, Software Engineering, Computer Engineering or demonstrable similar experience</li>\n<li>2+ years of working experience as a system administrator, platform engineer, backend engineer, or similar</li>\n<li>Very good understanding of Linux server administration, networking, distributed systems, security best practices</li>\n<li>Strong English language skills, written as well as oral</li>\n<li>Ability to work independently, as well as an effective part of the team</li>\n<li>Experience with log and metric collection</li>\n<li>Experience with configuration management systems</li>\n<li>Experience in writing automation scripts</li>\n<li>Knowledge and previous experience of computer networks and infrastructure is a big plus</li>\n<li>Experience working with cloud technology</li>\n<li>Experience or willingness to learn how to design, develop and maintain web applications and associated services (for instance with Python, Go or Ruby)</li>\n</ul>\n<p><strong>Why us?</strong></p>\n<p>We take care of our employees and provide you with:</p>\n<ul>\n<li>Almost flexible working hours with the option to work partially remote</li>\n<li>Modern computer and huge 4k screens</li>\n<li>A diverse and international environment</li>\n<li>A modern workplace close to the Berlin central station</li>\n<li>Fresh fruits, snacks and drinks</li>\n<li>Regular team events and monthly team breakfast as well as All Hands with pizza and beer</li>\n<li>Special employee offers for sports clubs, gadgets, fashion, ....</li>\n<li>And a lot of fun :)</li>\n</ul>\n<p>We are looking forward to seeing you!</p>\n<p><img src=\"https://camo.githubusercontent.com/08001d85969c9f91152b3be62c817530da5a329a/68747470733a2f2f742e676f686972696e672e636f6d2f682f30643539656562656635623839653065623138303233333434303832396661353161663164396666626137356266393035353766336335643138306636363536\"></p>\n",
"how_to_apply": "<p><a href=\"https://t.gohiring.com/h/81e72fda98d92c0e3ea3d44cfe817ce69ffb150cf0d9d55b2f4a66d30d06aaf1\">application form</a></p>\n",
"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTJUIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--17e537bed46c17a2a93de60195e7b50de0139b7f/Lawpilots.png"
}
]